HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxAsclin_reg.h
/** \brief 18, Frame Control Register */
#define ASCLIN12_FRAMECON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FRAMECON*)0xF02C0C18u)

/** \brief 1C, Data Configuration Register */
#define ASCLIN12_DATCON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_DATCON*)0xF02C0C1Cu)

/** \brief 20, Baud Rate Generation Register */
#define ASCLIN12_BRG /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_BRG*)0xF02C0C20u)

/** \brief 24, Baud Rate Detection Register */
#define ASCLIN12_BRD /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_BRD*)0xF02C0C24u)

/** \brief 28, LIN Control Register */
#define ASCLIN12_LIN_CON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_LIN_CON*)0xF02C0C28u)
/** Alias (User Manual Name) for ASCLIN12_LIN_CON.
* To use register names with standard convension, please use ASCLIN12_LIN_CON.
*/
#define ASCLIN12_LINCON (ASCLIN12_LIN_CON)

/** \brief 2C, LIN Break Timer Register */
#define ASCLIN12_LIN_BTIMER /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_LIN_BTIMER*)0xF02C0C2Cu)
/** Alias (User Manual Name) for ASCLIN12_LIN_BTIMER.
* To use register names with standard convension, please use ASCLIN12_LIN_BTIMER.
*/
#define ASCLIN12_LINBTIMER (ASCLIN12_LIN_BTIMER)

/** \brief 30, LIN Header Timer Register */
#define ASCLIN12_LIN_HTIMER /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_LIN_HTIMER*)0xF02C0C30u)
/** Alias (User Manual Name) for ASCLIN12_LIN_HTIMER.
* To use register names with standard convension, please use ASCLIN12_LIN_HTIMER.
*/
#define ASCLIN12_LINHTIMER (ASCLIN12_LIN_HTIMER)

/** \brief 34, Flags Register */
#define ASCLIN12_FLAGS /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGS*)0xF02C0C34u)

/** \brief 38, Flags Set Register */
#define ASCLIN12_FLAGSSET /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGSSET*)0xF02C0C38u)

/** \brief 3C, Flags Clear Register */
#define ASCLIN12_FLAGSCLEAR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGSCLEAR*)0xF02C0C3Cu)

/** \brief 40, Flags Enable Register */
#define ASCLIN12_FLAGSENABLE /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGSENABLE*)0xF02C0C40u)

/** \brief 44, Transmit Data Register */
#define ASCLIN12_TXDATA /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_TXDATA*)0xF02C0C44u)

/** \brief 48, Receive Data Register */
#define ASCLIN12_RXDATA /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_RXDATA*)0xF02C0C48u)

/** \brief 4C, Clock Selection Register */
#define ASCLIN12_CSR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_CSR*)0xF02C0C4Cu)

/** \brief 50, Receive Data Debug Register */
#define ASCLIN12_RXDATAD /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_RXDATAD*)0xF02C0C50u)

/** \brief E8, OCDS Control and Status */
#define ASCLIN12_OCS /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_OCS*)0xF02C0CE8u)

/** \brief EC, Kernel Reset Status Clear Register */
#define ASCLIN12_KRSTCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_KRSTCLR*)0xF02C0CECu)

/** \brief F0, Kernel Reset Register 1 */
#define ASCLIN12_KRST1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_KRST1*)0xF02C0CF0u)

/** \brief F4, Kernel Reset Register 0 */
#define ASCLIN12_KRST0 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_KRST0*)0xF02C0CF4u)

/** \brief FC, Access Enable Register 0 */
#define ASCLIN12_ACCEN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_ACCEN0*)0xF02C0CFCu)

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Asclin_Registers_Cfg_Asclin13
 * \{  */
/** \brief 0, Clock Control Register */
#define ASCLIN13_CLC /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_CLC*)0xF02C0D00u)

/** \brief 4, Input and Output Control Register */
#define ASCLIN13_IOCR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_IOCR*)0xF02C0D04u)

/** \brief 8, Module Identification Register */
#define ASCLIN13_ID /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_ID*)0xF02C0D08u)

/** \brief C, TX FIFO Configuration Register */
#define ASCLIN13_TXFIFOCON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_TXFIFOCON*)0xF02C0D0Cu)

/** \brief 10, RX FIFO Configuration Register */
#define ASCLIN13_RXFIFOCON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_RXFIFOCON*)0xF02C0D10u)

/** \brief 14, Bit Configuration Register */
#define ASCLIN13_BITCON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_BITCON*)0xF02C0D14u)

/** \brief 18, Frame Control Register */
#define ASCLIN13_FRAMECON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FRAMECON*)0xF02C0D18u)

/** \brief 1C, Data Configuration Register */
#define ASCLIN13_DATCON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_DATCON*)0xF02C0D1Cu)

/** \brief 20, Baud Rate Generation Register */
#define ASCLIN13_BRG /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_BRG*)0xF02C0D20u)

/** \brief 24, Baud Rate Detection Register */
#define ASCLIN13_BRD /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_BRD*)0xF02C0D24u)

/** \brief 28, LIN Control Register */
#define ASCLIN13_LIN_CON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_LIN_CON*)0xF02C0D28u)
/** Alias (User Manual Name) for ASCLIN13_LIN_CON.
* To use register names with standard convension, please use ASCLIN13_LIN_CON.
*/
#define ASCLIN13_LINCON (ASCLIN13_LIN_CON)

/** \brief 2C, LIN Break Timer Register */
#define ASCLIN13_LIN_BTIMER /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_LIN_BTIMER*)0xF02C0D2Cu)
/** Alias (User Manual Name) for ASCLIN13_LIN_BTIMER.
* To use register names with standard convension, please use ASCLIN13_LIN_BTIMER.
*/
#define ASCLIN13_LINBTIMER (ASCLIN13_LIN_BTIMER)

/** \brief 30, LIN Header Timer Register */
#define ASCLIN13_LIN_HTIMER /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_LIN_HTIMER*)0xF02C0D30u)
/** Alias (User Manual Name) for ASCLIN13_LIN_HTIMER.
* To use register names with standard convension, please use ASCLIN13_LIN_HTIMER.
*/
#define ASCLIN13_LINHTIMER (ASCLIN13_LIN_HTIMER)

/** \brief 34, Flags Register */
#define ASCLIN13_FLAGS /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGS*)0xF02C0D34u)

/** \brief 38, Flags Set Register */
#define ASCLIN13_FLAGSSET /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGSSET*)0xF02C0D38u)

