HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxAsclin_reg.h
/** \brief 18, Frame Control Register */
#define ASCLIN18_FRAMECON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FRAMECON*)0xF02C1218u)

/** \brief 1C, Data Configuration Register */
#define ASCLIN18_DATCON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_DATCON*)0xF02C121Cu)

/** \brief 20, Baud Rate Generation Register */
#define ASCLIN18_BRG /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_BRG*)0xF02C1220u)

/** \brief 24, Baud Rate Detection Register */
#define ASCLIN18_BRD /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_BRD*)0xF02C1224u)

/** \brief 28, LIN Control Register */
#define ASCLIN18_LIN_CON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_LIN_CON*)0xF02C1228u)
/** Alias (User Manual Name) for ASCLIN18_LIN_CON.
* To use register names with standard convension, please use ASCLIN18_LIN_CON.
*/
#define ASCLIN18_LINCON (ASCLIN18_LIN_CON)

/** \brief 2C, LIN Break Timer Register */
#define ASCLIN18_LIN_BTIMER /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_LIN_BTIMER*)0xF02C122Cu)
/** Alias (User Manual Name) for ASCLIN18_LIN_BTIMER.
* To use register names with standard convension, please use ASCLIN18_LIN_BTIMER.
*/
#define ASCLIN18_LINBTIMER (ASCLIN18_LIN_BTIMER)

/** \brief 30, LIN Header Timer Register */
#define ASCLIN18_LIN_HTIMER /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_LIN_HTIMER*)0xF02C1230u)
/** Alias (User Manual Name) for ASCLIN18_LIN_HTIMER.
* To use register names with standard convension, please use ASCLIN18_LIN_HTIMER.
*/
#define ASCLIN18_LINHTIMER (ASCLIN18_LIN_HTIMER)

/** \brief 34, Flags Register */
#define ASCLIN18_FLAGS /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGS*)0xF02C1234u)

/** \brief 38, Flags Set Register */
#define ASCLIN18_FLAGSSET /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGSSET*)0xF02C1238u)

/** \brief 3C, Flags Clear Register */
#define ASCLIN18_FLAGSCLEAR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGSCLEAR*)0xF02C123Cu)

/** \brief 40, Flags Enable Register */
#define ASCLIN18_FLAGSENABLE /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGSENABLE*)0xF02C1240u)

/** \brief 44, Transmit Data Register */
#define ASCLIN18_TXDATA /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_TXDATA*)0xF02C1244u)

/** \brief 48, Receive Data Register */
#define ASCLIN18_RXDATA /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_RXDATA*)0xF02C1248u)

/** \brief 4C, Clock Selection Register */
#define ASCLIN18_CSR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_CSR*)0xF02C124Cu)

/** \brief 50, Receive Data Debug Register */
#define ASCLIN18_RXDATAD /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_RXDATAD*)0xF02C1250u)

/** \brief E8, OCDS Control and Status */
#define ASCLIN18_OCS /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_OCS*)0xF02C12E8u)

/** \brief EC, Kernel Reset Status Clear Register */
#define ASCLIN18_KRSTCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_KRSTCLR*)0xF02C12ECu)

/** \brief F0, Kernel Reset Register 1 */
#define ASCLIN18_KRST1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_KRST1*)0xF02C12F0u)

/** \brief F4, Kernel Reset Register 0 */
#define ASCLIN18_KRST0 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_KRST0*)0xF02C12F4u)

/** \brief FC, Access Enable Register 0 */
#define ASCLIN18_ACCEN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_ACCEN0*)0xF02C12FCu)

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Asclin_Registers_Cfg_Asclin19
 * \{  */
/** \brief 0, Clock Control Register */
#define ASCLIN19_CLC /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_CLC*)0xF02C1300u)

/** \brief 4, Input and Output Control Register */
#define ASCLIN19_IOCR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_IOCR*)0xF02C1304u)

/** \brief 8, Module Identification Register */
#define ASCLIN19_ID /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_ID*)0xF02C1308u)

/** \brief C, TX FIFO Configuration Register */
#define ASCLIN19_TXFIFOCON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_TXFIFOCON*)0xF02C130Cu)

/** \brief 10, RX FIFO Configuration Register */
#define ASCLIN19_RXFIFOCON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_RXFIFOCON*)0xF02C1310u)

/** \brief 14, Bit Configuration Register */
#define ASCLIN19_BITCON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_BITCON*)0xF02C1314u)

/** \brief 18, Frame Control Register */
#define ASCLIN19_FRAMECON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FRAMECON*)0xF02C1318u)

/** \brief 1C, Data Configuration Register */
#define ASCLIN19_DATCON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_DATCON*)0xF02C131Cu)

/** \brief 20, Baud Rate Generation Register */
#define ASCLIN19_BRG /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_BRG*)0xF02C1320u)

/** \brief 24, Baud Rate Detection Register */
#define ASCLIN19_BRD /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_BRD*)0xF02C1324u)

/** \brief 28, LIN Control Register */
#define ASCLIN19_LIN_CON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_LIN_CON*)0xF02C1328u)
/** Alias (User Manual Name) for ASCLIN19_LIN_CON.
* To use register names with standard convension, please use ASCLIN19_LIN_CON.
*/
#define ASCLIN19_LINCON (ASCLIN19_LIN_CON)

/** \brief 2C, LIN Break Timer Register */
#define ASCLIN19_LIN_BTIMER /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_LIN_BTIMER*)0xF02C132Cu)
/** Alias (User Manual Name) for ASCLIN19_LIN_BTIMER.
* To use register names with standard convension, please use ASCLIN19_LIN_BTIMER.
*/
#define ASCLIN19_LINBTIMER (ASCLIN19_LIN_BTIMER)

/** \brief 30, LIN Header Timer Register */
#define ASCLIN19_LIN_HTIMER /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_LIN_HTIMER*)0xF02C1330u)
/** Alias (User Manual Name) for ASCLIN19_LIN_HTIMER.
* To use register names with standard convension, please use ASCLIN19_LIN_HTIMER.
*/
#define ASCLIN19_LINHTIMER (ASCLIN19_LIN_HTIMER)

/** \brief 34, Flags Register */
#define ASCLIN19_FLAGS /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGS*)0xF02C1334u)

/** \brief 38, Flags Set Register */
#define ASCLIN19_FLAGSSET /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGSSET*)0xF02C1338u)

